app/controllers/teams_controller.rb

INSERT INTO "teams" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-07-02 22:11:56.797324"], ["updated_at", "2018-07-02 22:11:56.797324"]]
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save

DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 3]]
---
  def destroy
    @team.destroy